Revit 2027 API
Rebar.GetOverridableHookParameters Method
 Outputs the formula parameter ids defined in the RebarShape family which are associated with hook length and hook tangent length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void GetOverridableHookParameters(
	out ISet<ElementId> startHookLengthPrameters,
	out ISet<ElementId> startHookTangentLengthParameters,
	out ISet<ElementId> endHookLengthParameters,
	out ISet<ElementId> endHookTangentLengthParameters
)
Public Sub GetOverridableHookParameters (
	<OutAttribute> ByRef startHookLengthPrameters As ISet(Of ElementId),
	<OutAttribute> ByRef startHookTangentLengthParameters As ISet(Of ElementId),
	<OutAttribute> ByRef endHookLengthParameters As ISet(Of ElementId),
	<OutAttribute> ByRef endHookTangentLengthParameters As ISet(Of ElementId)
)
public:
void GetOverridableHookParameters(
	[OutAttribute] ISet<ElementId^>^% startHookLengthPrameters,
	[OutAttribute] ISet<ElementId^>^% startHookTangentLengthParameters,
	[OutAttribute] ISet<ElementId^>^% endHookLengthParameters,
	[OutAttribute] ISet<ElementId^>^% endHookTangentLengthParameters
)
member GetOverridableHookParameters :
        startHookLengthPrameters : ISet<ElementId> byref *
        startHookTangentLengthParameters : ISet<ElementId> byref *
        endHookLengthParameters : ISet<ElementId> byref *
        endHookTangentLengthParameters : ISet<ElementId> byref -> unit
Parameters
startHookLengthPrameters ISet<ElementId>
 The formula parameter ids defined in the RebarShape family which are associated with start hook length parameters.
startHookTangentLengthParameters ISet<ElementId>
 The formula parameter ids defined in the RebarShape family which are associated with start hook tangent length parameters.
endHookLengthParameters ISet<ElementId>
 The formula parameter ids defined in the RebarShape family which are associated with end hook length parameters.
endHookTangentLengthParameters ISet<ElementId>
 The formula parameter ids defined in the RebarShape family which are associated with end hook tangent length parameters.
Exceptions
Exception | Condition
InvalidOperationException |  The ability to override hook lengths is not enabled for this rebar instance. Use enableHookLengthOverride(true) to enable it.
Remarks
 Will throw an exception if the hook length override is not enabled.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace